In [19]:
import pandas as pd

In [20]:
df = pd.read_excel('https://taanila.fi/data1.xlsx')

In [21]:
df[(df["koulutus"]!=1) & (df["palkka"]<=1700)]

,nro,sukup,ikä,perhe,koulutus,palveluv,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja
25,26,1,26,1,2.0,3.0,1521,2,4.0,2,1,3,1.0,NaN,1.0,1.0
35,36,1,31,2,3.0,0.0,1559,2,4.0,3,1,3,1.0,NaN,NaN,NaN
53,54,1,25,1,2.0,1.0,1559,2,4.0,3,1,2,1.0,NaN,NaN,NaN
75,76,1,37,1,2.0,15.0,1598,1,5.0,1,1,1,1.0,NaN,NaN,NaN
77,78,1,22,1,3.0,0.0,1598,4,4.0,4,3,4,NaN,1.0,1.0,NaN

In [22]:
df.nsmallest(3, "palkka")

,nro,sukup,ikä,perhe,koulutus,palveluv,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja
25,26,1,26,1,2.0,3.0,1521,2,4.0,2,1,3,1.0,NaN,1.0,1.0
35,36,1,31,2,3.0,0.0,1559,2,4.0,3,1,3,1.0,NaN,NaN,NaN
53,54,1,25,1,2.0,1.0,1559,2,4.0,3,1,2,1.0,NaN,NaN,NaN

In [23]:
df.nlargest(5, "ikä")

,nro,sukup,ikä,perhe,koulutus,palveluv,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja
56,57,1,61,2,2.0,36.0,3119,2,NaN,2,1,5,1.0,NaN,NaN,1.0
32,33,1,59,2,3.0,15.0,6278,4,4.0,5,4,4,NaN,1.0,NaN,NaN
13,14,1,58,2,3.0,21.0,3587,4,5.0,4,1,3,NaN,NaN,NaN,NaN
27,28,2,56,1,1.0,15.0,2223,3,4.0,3,2,4,1.0,NaN,NaN,1.0
36,37,2,56,2,2.0,17.0,2729,5,5.0,5,5,5,NaN,NaN,NaN,1.0

In [24]:
df.describe()

,nro,sukup,ikä,perhe,koulutus,palveluv,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja
count,82.000000,82.000000,82.000000,82.000000,81.000000,80.000000,82.000000,82.000000,81.000000,82.000000,82.000000,82.000000,47.0,20.0,9.0,22.0
mean,41.500000,1.231707,37.951220,1.621951,1.987654,12.175000,2563.878049,3.060976,4.061728,3.219512,2.109756,3.195122,1.0,1.0,1.0,1.0
std,23.815261,0.424519,9.773866,0.487884,0.844006,8.807038,849.350302,1.058155,0.826826,1.154961,1.111179,1.047502,0.0,0.0,0.0,0.0
min,1.000000,1.000000,20.000000,1.000000,1.000000,0.000000,1521.000000,1.000000,2.000000,1.000000,1.000000,1.000000,1.0,1.0,1.0,1.0
25%,21.250000,1.000000,31.000000,1.000000,1.000000,3.750000,2027.000000,2.000000,4.000000,3.000000,1.000000,3.000000,1.0,1.0,1.0,1.0
50%,41.500000,1.000000,37.500000,2.000000,2.000000,12.500000,2320.000000,3.000000,4.000000,3.000000,2.000000,3.000000,1.0,1.0,1.0,1.0
75%,61.750000,1.000000,44.000000,2.000000,3.000000,18.250000,2808.000000,4.000000,5.000000,4.000000,3.000000,4.000000,1.0,1.0,1.0,1.0
max,82.000000,2.000000,61.000000,2.000000,4.000000,36.000000,6278.000000,5.000000,5.000000,5.000000,5.000000,5.000000,1.0,1.0,1.0,1.0

In [25]:
#Frekvenssitaulukko Crosstab!
df1 = pd.crosstab(df["koulutus"], "f")
df1

col_0      f
koulutus
1.0       27
2.0       30
3.0       22
4.0        2

In [26]:
df1.columns.name=""
df1

           f
koulutus
1.0       27
2.0       30
3.0       22
4.0        2

In [27]:
#Tehdään lista koulutusmuuttujaan ja sen jälkeen sijoitetaan lista dataframen indeksiin
koulutus = ["Peruskoulu", "2.aste", "Korkeakoulu", "Ylempi korkeakoulu"]
df1.index=koulutus
#Huomaa, että df1 on muuttuja, joka sisältää frekvenssitaulukon.
df1

                     f
Peruskoulu          27
2.aste              30
Korkeakoulu         22
Ylempi korkeakoulu   2

In [28]:
#Taulukkoon voidaan luoda sarake ja siihen voidaan viitata
n = df1["f"].sum() #Havaintojen lukumäärä
#Lisätään sarake %, joka on f sarakkeen rivin % lukema. Rivin/kokonaislukumäärä*100
df1["%"] = df1["f"]/n*100
df1

                     f          %
Peruskoulu          27  33.333333
2.aste              30  37.037037
Korkeakoulu         22  27.160494
Ylempi korkeakoulu   2   2.469136

In [29]:
#Lisätään uusi rivi .loc komennolla
df1.loc["Yhteensä"] = df1.sum()
df1

                       f           %
Peruskoulu          27.0   33.333333
2.aste              30.0   37.037037
Korkeakoulu         22.0   27.160494
Ylempi korkeakoulu   2.0    2.469136
Yhteensä            81.0  100.000000

In [30]:
df2 = pd.crosstab(df["koulutus"], df["sukup"]) #Voidaan tehdä myös ristiintaulukointi
df2

sukup      1  2
koulutus
1.0       22  5
2.0       23  7
3.0       15  7
4.0        2  0

In [31]:
sukupuoli = ["Mies", "Nainen"]
df2.index = koulutus #Menee indeksi sarakkeeseen
df2.columns = sukupuoli #Menee sarakeotsikoihin
df2

                    Mies  Nainen
Peruskoulu            22       5
2.aste                23       7
Korkeakoulu           15       7
Ylempi korkeakoulu     2       0

In [32]:
df2.index.name = "Koulutus"
df2.columns.name = "Sukupuoli"
df2

Sukupuoli           Mies  Nainen
Koulutus
Peruskoulu            22       5
2.aste                23       7
Korkeakoulu           15       7
Ylempi korkeakoulu     2       0

In [33]:
df = df.rename(columns={"sukup":"sukupuoli", "palveluv":"palveluvuodet"})
df.columns

Index(['nro', 'sukupuoli', 'ikä', 'perhe', 'koulutus', 'palveluvuodet',
       'palkka', 'johto', 'työtov', 'työymp', 'palkkat', 'työteht', 'työterv',
       'lomaosa', 'kuntosa', 'hieroja'],
      dtype='object')

In [34]:
df2 = df2.reset_index() #Indeksi siirretaan pois indeksistä ja tilalle laitetaan oletus indeksit 0,1,2...
df2

Sukupuoli            Koulutus  Mies  Nainen
0                  Peruskoulu    22       5
1                      2.aste    23       7
2                 Korkeakoulu    15       7
3          Ylempi korkeakoulu     2       0

In [36]:
df2 = df2.set_index("Koulutus")
df2

Sukupuoli           Mies  Nainen
Koulutus
Peruskoulu            22       5
2.aste                23       7
Korkeakoulu           15       7
Ylempi korkeakoulu     2       0

In [38]:
#Kuinka monta 2. asteen koulutuksen suorittanutta miestä on?
df2.loc["2.aste", "Mies"]

np.int64(23)

In [39]:
#Pelkkä : tarkoittaa kaikkia rivejä ja kaikkia sarakkeita
df2.loc[:, "Nainen"]

Koulutus
Peruskoulu            5
2.aste                7
Korkeakoulu           7
Ylempi korkeakoulu    0
Name: Nainen, dtype: int64

In [40]:
df2.loc[:, "Nainen"].to_frame() #Tämä tekee tuloksesta dataframen

                    Nainen
Koulutus
Peruskoulu               5
2.aste                   7
Korkeakoulu              7
Ylempi korkeakoulu       0

In [44]:
#Muodostetaan luokka CUT funktiolla. Bins parametrin arvoksi tulee lista
bins = [19, 29, 39, 49, 59, 69]

df["ikäluokka"] = pd.cut(df["ikä"], bins=bins) #Huomioi, että arvojen tulee nousta tietyssä järjestyksessä. Ei voi olla esim 19-29 ja 29-32, 39-49
df

,nro,sukupuoli,ikä,perhe,koulutus,palveluvuodet,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja,ikäluokka
0,1,1,38,1,1.0,22.0,3587,3,3.0,3,3,3,NaN,NaN,NaN,NaN,"(29, 39]"
1,2,1,29,2,2.0,10.0,2963,1,5.0,2,1,3,NaN,NaN,NaN,NaN,"(19, 29]"
2,3,1,30,1,1.0,7.0,1989,3,4.0,1,1,3,1.0,NaN,NaN,NaN,"(29, 39]"
3,4,1,36,2,1.0,14.0,2144,3,3.0,3,3,3,1.0,NaN,NaN,NaN,"(29, 39]"
4,5,1,24,1,2.0,4.0,2183,2,3.0,2,1,2,1.0,NaN,NaN,NaN,"(19, 29]"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
77,78,1,22,1,3.0,0.0,1598,4,4.0,4,3,4,NaN,1.0,1.0,NaN,"(19, 29]"
78,79,1,33,1,1.0,2.0,1638,1,3.0,2,1,2,1.0,NaN,NaN,NaN,"(29, 39]"
79,80,1,27,1,2.0,7.0,2612,3,4.0,3,3,3,1.0,NaN,1.0,NaN,"(19, 29]"
80,81,1,35,2,2.0,16.0,2808,3,4.0,3,3,3,NaN,NaN,NaN,NaN,"(29, 39]"
81,82,2,35,2,3.0,15.0,2183,3,4.0,4,3,4,1.0,NaN,NaN,NaN,"(29, 39]"

In [45]:
#Tehdään frekvenssitaulukko ikäluokista
df3 = pd.crosstab(df["ikäluokka"], "ikä")
df3.columns.name = ""
df3

           ikä
ikäluokka
(19, 29]    17
(29, 39]    30
(39, 49]    23
(49, 59]    11
(59, 69]     1

Ryhmittely

In [47]:
#Luodaan GroupBy ryhmittely. Funktiolle pitää antaa parametrinä sen muuttujan nimi, jonka mukaan ryhmitellään
df4 = df.groupby("koulutus")["palkka"].describe()
df4.index = koulutus
df4

,count,mean,std,min,25%,50%,75%,max
Peruskoulu,27.0,2310.481481,473.108653,1638.0,2008.00,2144.0,2534.0,3587.0
2.aste,30.0,2403.100000,533.984395,1521.0,2008.25,2378.5,2729.0,3510.0
Korkeakoulu,22.0,2887.227273,1108.404384,1559.0,2222.25,2710.0,2925.0,6278.0
Ylempi korkeakoulu,2.0,5147.000000,110.308658,5069.0,5108.00,5147.0,5186.0,5225.0

Luettelo muistiossa käytetyistä funktioista ja ominaisuuksista

Merkkijono (string) kirjoitetaan heittomerkkien '' väliin (myös lainausmerkit "" käyvät). Merkkijonoja ovat esimerkiksi tiedostonimet, dataframen sarakeotsikot (muuttujien nimet), muuttujien tekstimuotoiset arvot. Huomaa kuitenkin, että Pythonin muuttujien nimiä ei kirjoitetan heittomerkkien väliin (esimerkiksi df, n jne.)

Paketin tuonti import-toiminnolla; esimerkkinä pandas-paketin tuonti

Pythonin tietorakenne lista, joka kirjoitetaan hakasulkujen sisään

Pythonin tietorakenne sanakirja (dictionary), joka kirjoitetaan aaltosulkujen sisään

Pandas-kirjaston tietorakenteet dataframe ja series

pd.read_excel() datan lukeminen Excel-tiedostosta

df.shape datan rivien ja muuttujien (sarakkeiden) lukumäärät

df.info() arvojen lukumäärät ja tietotyypit

df.describe() tilastolliset tunnusluvut

df.nsmallest() n pienintä nimetyn muuttujan suhteen

df.nlargest() n suurinta nimetyn muuttujan suhteen

df[].unique() nimetyn muuttujan ainutkertaisten arvojen luettelo

pd.crosstab() lukumäärä- ja prosenttiyhteenvedot

df.columns sarakeotsikot

df.index riviotsikot

df.columns.name sarakeotsikoiden nimi

df.index.name riviotsikoiden nimi

df.rename() sarakeotsikoiden uudelleen nimeämiseen

df.reindex() sarkeotsikoiden tai indeksin uudelleen järjestäminen

df.reset_index() indeksin siirtäminen tavalliseksi sarakkeeksi (tilalle oletusindeksi)

df.set_index() sarakkeen siirtäminen indeksiin

df.loc[] viittaaminen dataframen "viipaleeseen"

df.to_frame() series dataframeksi

pd.cut() arvojen luokittelu

df.groupby() ryhmittely

df.T dataframen transponointi (rivien ja sarakkeiden vaihtaminen päittäin)